// 1. getElementById. //Возвращает ссылку на элемент по его идентификатору (ID);
// 2. querySelector(). //Возвращает первый элемент (Element) документа,
//     //который соответствует указанному селектору или группе селекторов.
// 3. onclick. //Возвращает обработчик события click на текущем элементе.
// 4. Метод preventDefault () //интерфейса Event сообщает User agent, что если
//      //событие необрабатывается явно, его действие по умолчанию не должно выполняться так, как обычно.
// 5. Функция parseInt() //принимает строку в качестве аргумента и
//     //возвращает целое число в соответствии с указанным основанием системы счисления
// 6. createElement.// В HTML-документах создает указанный в аргументе элемент
// 7. Свойство Node.firstChild //только для чтения, возвращающее первый потомок узла
//     //в древе или null, если узел является бездетным. Если узел это документ, он возвращает
//     //первый узел в списке своих прямых детей.
// 8. parentNode //родитель текущего элемента.
// 9. Метод Node.insertBefore() //добавляет элемент в  список дочерних элементов родителя перед указанным элементом.
// 10. Свойство Node.previousSibling //используется только для чтения, оно возвращает узел предшедствующий указанному 
//     //в родительском элементе childNodes, или null,  если указанный узел первый в своём родителе.
// 11. Доступное только для чтения свойство ParentNode.firstElementChild возвращает первый дочерный элемент
//      объекта (Element) или null если дочерних элементов нет.
// // 12. Свойство Node.nextSibling используется только для чтения и возвращает узел, непосредственно следующий
//      за данным узлом в списке  childNodes его родительского элемента, 
//      или null если данный узел последний в этом списке.
// 13.